In [2]:
#series , dataframe, model

import pandas as pd
import numpy as np

my_s = np.array(['apple','mango','banana','grapes'])
s = pd.Series(my_s)
print(s)

0     apple
1     mango
2    banana
3    grapes
dtype: object

In [3]:
my_s1=pd.Series([1.,2.,3.], index = ['a','b','c'])
print(my_s1)

a    1.0
b    2.0
c    3.0
dtype: float64

In [4]:
print(pd.Series([1,2,np.nan]))

0    1.0
1    2.0
2    NaN
dtype: float64

In [8]:
#Dataframe
#numpy to pandas

h = [[9,8,4],[7,6,5]]
df = pd.DataFrame(h)
print(df)

   0  1  2
0  9  8  4
1  7  6  5

In [7]:
# pandas to numpy

df_n = np.array(df)
print(df_n)

[[9 8]
 [7 6]]

In [11]:
#dictionary to dataframe

dic = {'Fruit':['Apple','Banana'], 'color':['red','yellow']}
dic
pd.DataFrame(data = dic)

    Fruit   color
0   Apple     red
1  Banana  yellow

In [14]:
#Range Data

dates = pd.date_range('20300101',periods = 6, freq='D')
print('Day:', dates)

Day: DatetimeIndex(['2030-01-01', '2030-01-02', '2030-01-03', '2030-01-04',
               '2030-01-05', '2030-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
#Range Data

dates = pd.date_range('20300101',periods = 6, freq='M')
print('Months:', dates)

Months: DatetimeIndex(['2030-01-31', '2030-02-28', '2030-03-31', '2030-04-30',
               '2030-05-31', '2030-06-30'],
              dtype='datetime64[ns]', freq='M')

In [16]:
dates = pd.date_range('20300101',periods = 6, freq='Y')
print('Y:', dates)

Y: DatetimeIndex(['2030-12-31', '2031-12-31', '2032-12-31', '2033-12-31',
               '2034-12-31', '2035-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [17]:
#inspect data

random = np.random.randn(6,4)
random

array([[-0.38921386,  0.33101655,  0.19579057,  0.50901439],
       [-0.762839  ,  0.35203859, -0.89873027,  0.18566349],
       [-1.15009761,  0.12723037,  0.22935193, -0.95132477],
       [ 0.13007762,  1.05822173,  0.97131639,  0.37741072],
       [ 2.15838623, -0.01032833, -0.5618828 , -0.31687004],
       [ 0.14906316, -0.06055381, -0.2059658 ,  0.44132799]])

In [18]:
df = pd.DataFrame(random,index = dates, columns = list('ABCD'))

In [19]:
df

                   A         B         C         D
2030-12-31 -0.389214  0.331017  0.195791  0.509014
2031-12-31 -0.762839  0.352039 -0.898730  0.185663
2032-12-31 -1.150098  0.127230  0.229352 -0.951325
2033-12-31  0.130078  1.058222  0.971316  0.377411
2034-12-31  2.158386 -0.010328 -0.561883 -0.316870
2035-12-31  0.149063 -0.060554 -0.205966  0.441328

In [20]:
df = pd.DataFrame(random,index = list('EFGHJK'), columns = list('ABCD'))
df

          A         B         C         D
E -0.389214  0.331017  0.195791  0.509014
F -0.762839  0.352039 -0.898730  0.185663
G -1.150098  0.127230  0.229352 -0.951325
H  0.130078  1.058222  0.971316  0.377411
J  2.158386 -0.010328 -0.561883 -0.316870
K  0.149063 -0.060554 -0.205966  0.441328

In [21]:
df.head(3)

          A         B         C         D
E -0.389214  0.331017  0.195791  0.509014
F -0.762839  0.352039 -0.898730  0.185663
G -1.150098  0.127230  0.229352 -0.951325

In [23]:
df.tail(3)

          A         B         C         D
H  0.130078  1.058222  0.971316  0.377411
J  2.158386 -0.010328 -0.561883 -0.316870
K  0.149063 -0.060554 -0.205966  0.441328

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.022563  0.299604 -0.045020  0.040870
std    1.161968  0.408588  0.661526  0.570294
min   -1.150098 -0.060554 -0.898730 -0.951325
25%   -0.669433  0.024061 -0.472904 -0.191237
50%   -0.129568  0.229123 -0.005088  0.281537
75%    0.144317  0.346783  0.220962  0.425349
max    2.158386  1.058222  0.971316  0.509014

In [27]:
#slice column

df[['A','B']]

          A         B
E -0.389214  0.331017
F -0.762839  0.352039
G -1.150098  0.127230
H  0.130078  1.058222
J  2.158386 -0.010328
K  0.149063 -0.060554

In [29]:
df.iloc[1]

A   -0.762839
B    0.352039
C   -0.898730
D    0.185663
Name: F, dtype: float64

In [30]:
df.iloc[[1]]

          A         B        C         D
F -0.762839  0.352039 -0.89873  0.185663

In [36]:
df.iloc[ :,-1]

E    0.509014
F    0.185663
G   -0.951325
H    0.377411
J   -0.316870
K    0.441328
Name: D, dtype: float64

In [49]:
df1 = pd.DataFrame({'city':['Delhi','mumbai','Banglore'],'Malls':['60','70','50']}, index = [0,1,2])

                    
df1

       city Malls
0     Delhi    60
1    mumbai    70
2  Banglore    50

In [47]:
df2 = pd.DataFrame({'city':['Chennai','mumbai'],'Malls':['43','70']}, index = [3,4])

In [48]:
df2

      city Malls
3  Chennai    43
4   mumbai    70

In [50]:
df_concat = pd.concat([df1,df2])
df_concat

       city Malls
0     Delhi    60
1    mumbai    70
2  Banglore    50
3   Chennai    43
4    mumbai    70

In [51]:
df_concat.drop_duplicates('city')

       city Malls
0     Delhi    60
1    mumbai    70
2  Banglore    50
3   Chennai    43

In [52]:
df_concat.sort_values('Malls')

       city Malls
3   Chennai    43
2  Banglore    50
0     Delhi    60
1    mumbai    70
4    mumbai    70

In [54]:
df_concat.rename(columns={'city': 'Metro cities','Malls':'No of malls'})

  Metro cities No of malls
0        Delhi          60
1       mumbai          70
2     Banglore          50
3      Chennai          43
4       mumbai          70